Revit 2026 API

# View3DIsLocked Property

---

Indicates if the view is locked.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsLocked { get; }
```
```vb
Public ReadOnly Property IsLocked As Boolean
	Get
```
```cpp
public:
property bool IsLocked {
	bool get ();
}
```
```fsharp
member IsLocked : bool with get
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Returns true if the view is not a view template. |

#### Reference

View3D Class

Autodesk.Revit.DB Namespace